using System;

namespace ConsoleApp1
{
    internal class Program{
        static void Main(string[] args){
            //int a = 5, b = 6;
            //Console.WriteLine(a);
            //Console.WriteLine(b);

            //string data;
            //data = Console.ReadLine();
            //Console.WriteLine("Privet " + data);

            //Калькулятор простой на сложение c конвертацией
            //string str;
            //int a, b;
            //Console.WriteLine("Введите первое число");
            //str = Console.ReadLine();
            //a = Convert.ToInt32(str);
            //Console.WriteLine("Введите второе число");
            //str = Console.ReadLine();
            //b = Convert.ToInt32(str);
            //Console.WriteLine(a + b);

            //Напишите программу вычисляющую среднее арифметическое двух чисел
            //int a = 12;
            //int b = 5;
            //double result = ((double) a + b) / 2;
            //Console.WriteLine(result);

            //Напишите программу вычисляющую среднее арифметическое двух чисел(с вводом в консоле)
            //double firstValue, secondValue;
            //Console.WriteLine("Введите значение 1");
            //firstValue  = double.Parse(Console.ReadLine());
            //Console.WriteLine("Введите значение 2");
            //secondValue = double.Parse(Console.ReadLine());
            //double result = (firstValue + secondValue) / 2;
            //Console.WriteLine("Среднее арифметичкое двух чисел : " + result);

            //Введите 3 числа и выведете на экран значения суммы и произведения этих чисел
            //int a = 2;
            //int b = 3;
            //int c = 4;
            //Console.WriteLine(a + b + c);
            //Console.WriteLine(a * b * c);
        }
    }
}
